test/fixtures/files/stripe/invoice.payment_failed.json

{
  "object": {
    "id": "in_1DoPCn41RYaNOitnmAtgZ7CO",
    "object": "invoice",
    "amount_due": 500,
    "amount_paid": 0,
    "amount_remaining": 500,
    "application_fee": null,
    "attempt_count": 0,
    "attempted": false,
    "auto_advance": true,
    "billing": "charge_automatically",
    "billing_reason": "subscription_cycle",
    "charge": null,
    "currency": "usd",
    "customer": "cus_EGxhkjisExwTh7",
    "date": 1546495041,
    "default_source": null,
    "description": null,
    "discount": null,
    "due_date": null,
    "ending_balance": null,
    "finalized_at": null,
    "hosted_invoice_url": null,
    "invoice_pdf": null,
    "lines": {
      "data": [
        {
          "id": "sli_d26a19226a63d7",
          "object": "line_item",
          "amount": 300,
          "currency": "usd",
          "description": "1 × Beginner (at $3.00 / month)",
          "discountable": true,
          "livemode": false,
          "metadata": {},
          "period": {
            "end": 1491666324,
            "start": 1488987924
          },
          "plan": {
            "id": "default",
            "object": "plan",
            "active": false,
            "aggregate_usage": null,
            "amount": 1000,
            "amount_decimal": "1000",
            "billing_scheme": "per_unit",
            "created": 1550536589,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {
            },
            "nickname": "default",
            "product": "prod_EYTX7RYhRjcwKD",
            "tiers_mode": null,
            "transform_usage": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "price": {
            "id": "default",
            "object": "price",
            "active": false,
            "billing_scheme": "per_unit",
            "created": 1550536589,
            "currency": "usd",
            "livemode": false,
            "lookup_key": null,
            "metadata": {
            },
            "nickname": "default",
            "product": "prod_EYTX7RYhRjcwKD",
            "recurring": {
              "aggregate_usage": null,
              "interval": "month",
              "interval_count": 1,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "tax_behavior": "unspecified",
            "tiers_mode": null,
            "transform_quantity": null,
            "type": "recurring",
            "unit_amount": 1000,
            "unit_amount_decimal": "1000"
          },
          "proration": false,
          "quantity": 1,
          "subscription": "sub_8hLB3Ht92UjsVa",
          "subscription_item": "si_18PwUi41RYaNOitn11Z18bjy",
          "type": "subscription"
        }
      ],
      "has_more": false,
      "object": "list",
      "url": "/v1/invoices/in_1DoPCn41RYaNOitnmAtgZ7CO/lines"
    },
    "latest_invoice": "in_1000",
    "livemode": false,
    "metadata": {},
    "next_payment_attempt": 1546498641,
    "number": "DDA7BAF-0007",
    "paid": false,
    "period_end": 1546494966,
    "period_start": 1543816566,
    "receipt_number": null,
    "starting_balance": 0,
    "statement_descriptor": null,
    "status": "open",
    "subscription": "sub_E5L5apALvTUyYW",
    "subtotal": 500,
    "tax": 0,
    "tax_percent": null,
    "total": 500,
    "webhooks_delivered_at": 1546495041
  }
}
